vlm/base/Catalogs/МоделиБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МоделиБюджетирования</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыМоделейБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУтверждениеБюджетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БюджетыПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БюджетыПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиФормироватьЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФункциональнаяВалюта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВФункциональнойВалюте</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

vlm/base/Catalogs/МоделиБюджетирования/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	//++ НЕ УТКА
	БюджетированиеСервер.ПроверитьЭкземплярРегламентногоЗадания(ЭтотОбъект, Отказ);
	//-- НЕ УТКА
	
	Если Не ЭтоНовый()
		И ЛимитыПоДаннымБюджетированияСервер.МодельБюджетированияИспользуетсяВНастройкахЛимитов(Ссылка) Тогда
		РеквизитыСравнения = "Статус,НачалоДействия,КонецДействия,ПометкаУдаления";
		ИсходныеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, РеквизитыСравнения);
		ТекущиеРеквизиты = Новый Структура(РеквизитыСравнения);
		ЗаполнитьЗначенияСвойств(ТекущиеРеквизиты, ЭтотОбъект, РеквизитыСравнения);
		Если Не ОбщегоНазначенияУТКлиентСервер.СтруктурыРавны(ИсходныеРеквизиты, ТекущиеРеквизиты, РеквизитыСравнения) Тогда
			НаборКэшНастроекЛимитов = РегистрыСведений.КэшНастроекЛимитовПоДаннымБюджетирования.СоздатьНаборЗаписей();
			УстановитьПривилегированныйРежим(Истина);
			НаборКэшНастроекЛимитов.Записать();
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//++ НЕ УТКА

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ЭтоГруппа Тогда
		РегламентноеЗадание = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
//-- НЕ УТКА

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//++ НЕ УТКА
	БюджетированиеСервер.УдалитьЭкземплярРегламентногоЗадания(ЭтотОбъект, Отказ);
	//-- НЕ УТКА
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//++ НЕ УТКА
	Если Не ЭтоГруппа Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭтапыПодготовкиБюджетов.Ссылка
		|ИЗ
		|	Справочник.ЭтапыПодготовкиБюджетов КАК ЭтапыПодготовкиБюджетов
		|ГДЕ
		|	ЭтапыПодготовкиБюджетов.Владелец = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если Не ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			СправочникОбъект = Справочники.ЭтапыПодготовкиБюджетов.СоздатьГруппу();
			СправочникОбъект.Владелец = Ссылка;
			СправочникОбъект.Периодичность = Периодичность;
			СправочникОбъект.ПорядокВыполненияЭтапов = Перечисления.ПорядокВыполненияЭтаповПодготовкиБюджетов.Параллельно;
			СправочникОбъект.УсловиеЗапуска = Перечисления.ТипыУсловийЗапускаЭтаповПодготовкиБюджетов.ДоНачалаПериода;
			СправочникОбъект.ТипСрока = Перечисления.ТипыСроковЭтаповПодготовкиБюджетов.ВКалендарныхДнях;
			СправочникОбъект.Записать();
			
		КонецЕсли;
	
	КонецЕсли;
	
	БюджетированиеСервер.УстановитьПараметрыЭкземплярРегламентногоЗадания(ЭтотОбъект, Отказ);
	//-- НЕ УТКА
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Перем Ошибки;
	
	Если Не ЭтоГруппа Тогда
		Если Статус = Перечисления.СтатусыМоделейБюджетирования.Закрыта Тогда
			ПроверяемыеРеквизиты.Добавить("КонецДействия");
		КонецЕсли;
		Если ЗначениеЗаполнено(КонецДействия) Тогда
			Если КонецДействия <= НачалоДействия Тогда
				ТекстОшибки = НСтр("ru = 'Дата окончания действия модели не может быть меньше даты начала действия';
									|en = 'Model expiration date cannot be less than the model effective date'");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "КонецДействия", ТекстОшибки, "");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
